peh_test_case_2D/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0008940465826640571;

boundaryField
{
    "(inlet|outlet)"
    {
        type            cyclic;
    }


	"(front|back)"
	{
		type empty;
	}
    "(top|hills)"
    {
      //  type            zeroGradient; 
        type            kqRWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
